In [3]:
import pandas as pd
import seaborn as sns

In [5]:
titanic = sns.load_dataset('titanic')

In [6]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [7]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
titanic.shape

(891, 15)

In [9]:
#Selecting , filtering and masking

In [26]:
type(titanic['age'])

pandas.core.series.Series

In [12]:
pandas.core.series.Series

pandas.core.series.Series

In [13]:
age = titanic["age"]
sum(age > 30)

305

In [14]:
sum(age < 30)

384

In [24]:
sex_and_age_titanic = titanic[['sex', 'age']]

In [25]:
sex_and_age_titanic.isna().sum

<bound method DataFrame.sum of        sex    age
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888  False   True
889  False  False
890  False  False

[891 rows x 2 columns]>

In [27]:
sex_and_age_titanic['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [ ]:
sex_and_age_titanic['sex'].value_counts(normalize=True)

In [21]:
titanic.groupby('sex')['age'].mean() #grouphy grour de données avec une valeurs psé (F/M)

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [29]:
sex_and_age_titanic[sex_and_age_titanic['age']<14]

        sex   age
7      male  2.00
10   female  4.00
16     male  2.00
24   female  8.00
43   female  3.00
..      ...   ...
827    male  1.00
831    male  0.83
850    male  4.00
852  female  9.00
869    male  4.00

[71 rows x 2 columns]

In [32]:
children_sex_age_titanic = sex_and_age_titanic[sex_and_age_titanic['age'] < 14]

In [34]:
children_sex_age_titanic['sex'].value_counts()

sex
male      37
female    34
Name: count, dtype: int64

In [42]:
bins = [0, 14, 20, 30, 60, 120] #age categories
labels = ['child', 'teen', 'young adult', 'adult', 'senior']

In [ ]:
sex_and_age_titanic = pd.cut(children_sex_age_titanic['age'], bins=bins, labels=labels)

In [ ]:
sex_and_age_titanic['age_group'].value_counts()

In [45]:
sex_and_age_titanic

        sex   age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]